Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
import pandas as pd

In [10]:
list=[4,8,15,16,23,42]
p_series=pd.Series(list)
p_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
list_2=['yogesh',"devtulla",12,12,12,34.5,67,["yogesh"],True]
p_l2=pd.Series(list_2)
p_l2

0      yogesh
1    devtulla
2          12
3          12
4          12
5        34.5
6          67
7    [yogesh]
8        True
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [12]:
data_frame3={"Name":["Alice","Bob","Claire"],"Age":[25,30,37],"Gender":["Female","Male","Female"]}
p_dataframe3=pd.DataFrame(data_frame3)
p_dataframe3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   37  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

1. One of the main differences between DataFrame and Series is that a DataFrame can have multiple columns, while a Series can only have one.

2. DataFrame can have different data types for each column, while a Series can only have one data type for the whole array.

3. A series is 1D array like structure with an index while a data frame is 2D table with rows and columns.

In [14]:
data4 = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Gender': ['Female', 'Male', 'Male', 'Male']}
df4 = pd.DataFrame(data4)
print("DataFrame:")
print(df4)

DataFrame:
      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [15]:
ages4 = pd.Series([25, 30, 35, 40], name='Age')
print("\nSeries:")
print(ages4)

Series:
0    25
1    30
2    35
3    40
Name: Age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [16]:
df4

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [18]:
df4.head()

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [19]:
df4.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [20]:
df4.tail(1)

    Name  Age Gender
3  David   40   Male

In [22]:
df4.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [24]:
df4["Name"]

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [25]:
df4[["Name","Age"]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature, while Panel is considered deprecated and is no longer recommended for use.mutable, meaning you can modify its elements, change the index labels, or add/delete elements after it has been created.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 30, 35, 40])
genders = pd.Series(['Female', 'Male', 'Male', 'Male'])

df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})
df

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male
3    David   40    Male

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
type(names)

pandas.core.series.Series